zagerx/BLDC/SoftWare/STM32G431CBUx/motorlib/motor_cfg.c
#include <stddef.h>

#include "_encoder_calib.h"
#include "device.h"
#include "inverter.h"
#include "motor.h"
#include "_pp_ident.h"
#include "_current_calib.h"
#include "motor_carible.h"
#include "statemachine.h"
#include "motor_mode.h"
#include "motor_state.h"

#include "currsmp.h"
#include "inverter.h"
#include "stm32_pwm.h"

#include "feedback.h"
#include "stm32_mt6816.h"
#include "stm32_as5047.h"

extern struct device motor1;

static struct inverter_config inverter1_cfg = {
	.tim_pwm_start = tim1_pwm_start,
	.tim_pwm_stop = tim1_pwm_stop,
	.tim_pwm_set = tim1_pwm_set,
};

static struct device inverter1 = {
	.config = &inverter1_cfg,
};

static struct currsmp_data currsmp1_data = {0};

static struct device currsmp1 = {
	.data = &currsmp1_data,
};

static struct feedback_config feedback1_cfg = {
	.get_raw = as5047_read_raw,
	.cpr = 16384,
	.pll_kp = 100.0f,
	.pll_ki = 1000.0f,
	.pos_estimate_weight = 0.1f,
};

static struct feedback_data feedback1_data = {
	.pll_kp_scale = 1.0f,
};

static struct device feedback1 = {
	.config = &feedback1_cfg,
	.data = &feedback1_data,
};
static struct motor_config m1_cfg = {
	.currsmp = &currsmp1,
	.feedback = &feedback1,
	.inverter = &inverter1,
};

static fsm_cb_t m1_statemachine = {
	.current_state = motor_idle_state,
	.previous_state = motor_idle_state,
	.sub_state_machine = NULL,
	.p1 = &motor1,
};

static struct pp_ident_config pp_cfg = {
	.feedback = &feedback1,
	.inverter = &inverter1,
	.encoder_max = 16383,
	.openloop_speed = 5.0f,
	.openloop_voltage = 0.03f,
	.rotate_duration = 6.0f,
	.align_duration = 1.0f,
};
static struct pp_ident_data pp_data = {0};
static struct device pp1 = {
	.config = &pp_cfg,
	.data = &pp_data,
};
static struct curr_calib_config curr_calib_cfg1 = {
	.currsmp = &currsmp1,
	.inverter = &inverter1,
	.align_duration = 1.0f,
	.sample_count = 1000,
};
static struct curr_calib_data curr_calib_data1 = {0};
static struct device curr_calib = {
	.config = &curr_calib_cfg1,
	.data = &curr_calib_data1,
};
static struct encoder_calib_config ec_carb_cfg1 = {
	.feedback = &feedback1,
	.inverter = &inverter1,
	.encoder_max = 16383,
	.openloop_speed = 5.0f,
	.openloop_voltage = 0.03f,
	.align_voltage = 0.03f,
	.rotate_duration = 6.0f,
	.min_rotation_frac = 0.05f,
	.align_duration = 2.0f,

};
static struct encoder_calib_data ec_carb_data1 = {0};
static struct device encoder1_calib = {
	.config = &ec_carb_cfg1,
	.data = &ec_carb_data1,
};
static struct motor_calibration_modules m1_calib_modul = {
	.pp_ident = &pp1,
	.current_calibration = &curr_calib,
	.encoder_calibration = &encoder1_calib,
};

static struct motor_data m1_data = {
	.statue = MOTOR_STATE_IDLE,
	.mode = MOTOR_MODE_IDLE,
	.faultcode = MOTOR_FAULTCODE_NOERR,
	.state_machine = &m1_statemachine,
	.calib = &m1_calib_modul,
};

struct device motor1 = {
	.config = &m1_cfg,
	.data = &m1_data,
};
